barome/me102a/drivers/net/wireless/rtl8723BS/hal/hal_com_phycfg.c
	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][5] >> 24 ) & 0xFF; 
	base = ( rawValue >> 4) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, HT_MCS8_MCS15, RF_2TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][7] & 0xFF ); 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, CCK, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][9] >> 24 ) & 0xFF; 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, OFDM, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][11] >> 24 ) & 0xFF; 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, HT_MCS0_MCS7, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][13] >> 24 ) & 0xFF; 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, HT_MCS8_MCS15, RF_2TX, base );
}

VOID
PHY_StoreTxPowerByRateBase(	
	IN	PADAPTER	pAdapter
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA( pAdapter );
	PDM_ODM_T		pDM_Odm = &pHalData->odmpriv;

	if ( pDM_Odm->PhyRegPgVersion == 0 )
	{
		phy_StoreTxPowerByRateBaseOld( pAdapter );
	}
	else 
	{
		if ( IS_HARDWARE_TYPE_8723B( pAdapter ) ) {
#if (RTL8723B_SUPPORT == 1)
			PHY_StoreTxPowerByRateBase_8723B( pAdapter );
#endif
		} else if ( IS_HARDWARE_TYPE_8192E( pAdapter ) ) {
#if (RTL8192E_SUPPORT == 1)
			PHY_StoreTxPowerByRateBase_8192E( pAdapter );
#endif
		} else if ( IS_HARDWARE_TYPE_JAGUAR( pAdapter ) ) {
#if ((RTL8812A_SUPPORT==1) || (RTL8821A_SUPPORT == 1))
			PHY_StoreTxPowerByRateBase_8812A( pAdapter );
#endif
		}
	}
}

u8
PHY_GetRateSectionIndexOfTxPowerByRate(
	IN	PADAPTER	pAdapter,
	IN	u32			RegAddr,
	IN	u32			BitMask
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA( pAdapter );
	PDM_ODM_T		pDM_Odm = &pHalData->odmpriv;
	u8 			index = 0;
	
	if ( pDM_Odm->PhyRegPgVersion == 0 )
	{
		switch ( RegAddr )
		{
			case rTxAGC_A_Rate18_06:	 index = 0;		break;
			case rTxAGC_A_Rate54_24:	 index = 1;		break;
			case rTxAGC_A_CCK1_Mcs32:	 index = 6;		break;
			case rTxAGC_B_CCK11_A_CCK2_11:
				if ( BitMask == 0xffffff00 )
					index = 7;
				else if ( BitMask == 0x000000ff )
					index = 15;
				break;
				
			case rTxAGC_A_Mcs03_Mcs00:	 index = 2;		break;
			case rTxAGC_A_Mcs07_Mcs04:	 index = 3;		break;
			case rTxAGC_A_Mcs11_Mcs08:	 index = 4;		break;
			case rTxAGC_A_Mcs15_Mcs12:	 index = 5;		break;
			case rTxAGC_B_Rate18_06:	 index = 8;		break;
			case rTxAGC_B_Rate54_24:	 index = 9;		break;
			case rTxAGC_B_CCK1_55_Mcs32: index = 14;	break;
			case rTxAGC_B_Mcs03_Mcs00:	 index = 10;	break;
			case rTxAGC_B_Mcs07_Mcs04:	 index = 11;	break;
			case rTxAGC_B_Mcs11_Mcs08:	 index = 12;	break;
			case rTxAGC_B_Mcs15_Mcs12:	 index = 13;	break;
			default:
				DBG_871X("Invalid RegAddr 0x3%x in PHY_GetRateSectionIndexOfTxPowerByRate()", RegAddr );
				break;
		};
	}
	else if ( pDM_Odm->PhyRegPgVersion > 0 )
	{
		switch ( RegAddr )
		{
			case rTxAGC_A_Rate18_06:	   index = 0;		break;
			case rTxAGC_A_Rate54_24:	   index = 1;		break;
			case rTxAGC_A_CCK1_Mcs32:	   index = 2;		break;
			case rTxAGC_B_CCK11_A_CCK2_11: index = 3;		break;			
			case rTxAGC_A_Mcs03_Mcs00:	   index = 4;		break;
			case rTxAGC_A_Mcs07_Mcs04:	   index = 5;		break;
			case rTxAGC_A_Mcs11_Mcs08:	   index = 6;		break;
			case rTxAGC_A_Mcs15_Mcs12:	   index = 7;		break;
			case rTxAGC_B_Rate18_06:	   index = 0;		break;
			case rTxAGC_B_Rate54_24:	   index = 1;		break;
			case rTxAGC_B_CCK1_55_Mcs32:   index = 2;		break;
			case rTxAGC_B_Mcs03_Mcs00:	   index = 4;		break;
			case rTxAGC_B_Mcs07_Mcs04:	   index = 5;		break;
			case rTxAGC_B_Mcs11_Mcs08:	   index = 6;		break;
			case rTxAGC_B_Mcs15_Mcs12:	   index = 7;		break;
			default:
				RegAddr =  ( RegAddr & 0xFFF );
				if ( RegAddr >= 0xC20 && RegAddr <= 0xC4C )
					index = ( u8 ) ( ( RegAddr - 0xC20 ) / 4 );
				else if ( RegAddr >= 0xE20 && RegAddr <= 0xE4C )
					index = ( u8 ) ( ( RegAddr - 0xE20 ) / 4 );
				else
					DBG_871X("Invalid RegAddr 0x%x in PHY_GetRateSectionIndexOfTxPowerByRate()\n", RegAddr);
				break;
		};
	}
	
	return index;
}

u8
PHY_GetTxPowerByRateNew(
	IN	PADAPTER	pAdapter,
	IN	u8			Band,
	IN	u8			RfPath,
	IN	u8			TxNum,
	IN	u8			Rate
	)
{
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(pAdapter);
	u8			shift = 0;
	u8			tx_pwr_diff = 0;
	u8			rate_section = 0;

	if ( Band != BAND_ON_2_4G && Band != BAND_ON_5G )
	{
		DBG_871X("Invalid Band %d\n", Band );
	}

	if ( RfPath > ODM_RF_PATH_MAX )
	{
		DBG_871X("Invalid RfPath %d\n", RfPath );
	}

	if ( TxNum > ODM_RF_PATH_MAX )
	{
		DBG_871X("Invalid TxNum %d\n", TxNum );
	}

	switch	(Rate)
	{
		case	MGN_1M:
		case	MGN_2M:
		case	MGN_5_5M:	
		case	MGN_11M:	
			rate_section = 0;
			break;

		case	MGN_6M:		
		case	MGN_9M:		
		case	MGN_12M:	
		case	MGN_18M:	
			rate_section = 1;
			break;

		case	MGN_24M:	
		case	MGN_36M:    
		case	MGN_48M:    
		case	MGN_54M:    
			rate_section = 2;
			break;
		
		case	MGN_MCS0:	
		case	MGN_MCS1:   
		case	MGN_MCS2:   
		case	MGN_MCS3:   
			rate_section = 3;
			break;

		case	MGN_MCS4:	
		case	MGN_MCS5:   
		case	MGN_MCS6:   
		case	MGN_MCS7:   
			rate_section = 4;
			break;

		case	MGN_MCS8:	
		case	MGN_MCS9:   
		case	MGN_MCS10:  
		case	MGN_MCS11:  
			rate_section = 5;
			break;

		case	MGN_MCS12:	
		case	MGN_MCS13:  
		case	MGN_MCS14:  
		case	MGN_MCS15:  
			rate_section = 6;
			break;
		
		case	MGN_VHT1SS_MCS0:	
		case	MGN_VHT1SS_MCS1:    
		case	MGN_VHT1SS_MCS2:    
		case	MGN_VHT1SS_MCS3:    
			rate_section = 7;
			break;

		case	MGN_VHT1SS_MCS4:	
		case	MGN_VHT1SS_MCS5:    
		case	MGN_VHT1SS_MCS6:    
		case	MGN_VHT1SS_MCS7:    
			rate_section = 8;
			break;

		case	MGN_VHT1SS_MCS8:	
		case	MGN_VHT1SS_MCS9:    
		case	MGN_VHT2SS_MCS0:    
		case	MGN_VHT2SS_MCS1:    
			rate_section = 9;
			break;

		case	MGN_VHT2SS_MCS2:	
		case	MGN_VHT2SS_MCS3:    
		case	MGN_VHT2SS_MCS4:    
		case	MGN_VHT2SS_MCS5:    
			rate_section = 10;
			break;

		case	MGN_VHT2SS_MCS6:	
		case	MGN_VHT2SS_MCS7:    
		case	MGN_VHT2SS_MCS8:    
		case	MGN_VHT2SS_MCS9:    
			rate_section = 11;
			break;
			
		default:
			DBG_871X("Rate %dis Illegal\n", Rate);
			break;
	}
	
