barome/me102a/drivers/net/wireless/rtl8723BS/hal/hal_com_phycfg.c
	switch	(Rate)
	{
		case	MGN_1M:		shift = 0;		break;
		case	MGN_2M:		shift = 8;		break;
		case	MGN_5_5M:	shift = 16;		break;
		case	MGN_11M:	shift = 24;		break;			

		case	MGN_6M:		shift = 0;		break;
		case	MGN_9M:		shift = 8;      break;
		case	MGN_12M:	shift = 16;     break;
		case	MGN_18M:	shift = 24;     break;
			
		case	MGN_24M:	shift = 0;    	break;
		case	MGN_36M:    shift = 8;      break;
		case	MGN_48M:    shift = 16;     break;
		case	MGN_54M:    shift = 24;     break;
			
		case	MGN_MCS0:	shift = 0; 		break;
		case	MGN_MCS1:   shift = 8;      break;
		case	MGN_MCS2:   shift = 16;     break;
		case	MGN_MCS3:   shift = 24;     break;
			
		case	MGN_MCS4:	shift = 0; 		break;
		case	MGN_MCS5:   shift = 8;      break;
		case	MGN_MCS6:   shift = 16;     break;
		case	MGN_MCS7:   shift = 24;     break;
			
		case	MGN_MCS8:	shift = 0; 		break;
		case	MGN_MCS9:   shift = 8;      break;
		case	MGN_MCS10:  shift = 16;     break;
		case	MGN_MCS11:  shift = 24;     break;
			
		case	MGN_MCS12:	shift = 0; 		break;
		case	MGN_MCS13:  shift = 8;      break;
		case	MGN_MCS14:  shift = 16;     break;
		case	MGN_MCS15:  shift = 24;     break;
			
		case	MGN_VHT1SS_MCS0:	shift = 0; 		break;
		case	MGN_VHT1SS_MCS1:    shift = 8;      break;
		case	MGN_VHT1SS_MCS2:    shift = 16;     break;
		case	MGN_VHT1SS_MCS3:    shift = 24;     break;
			
		case	MGN_VHT1SS_MCS4:	shift = 0; 		break;
		case	MGN_VHT1SS_MCS5:    shift = 8;      break;
		case	MGN_VHT1SS_MCS6:    shift = 16;     break;
		case	MGN_VHT1SS_MCS7:    shift = 24;     break;
			
		case	MGN_VHT1SS_MCS8:	shift = 0; 		break;
		case	MGN_VHT1SS_MCS9:    shift = 8;      break;
		case	MGN_VHT2SS_MCS0:    shift = 16;     break;
		case	MGN_VHT2SS_MCS1:    shift = 24;     break;
			
		case	MGN_VHT2SS_MCS2:	shift = 0; 		break;
		case	MGN_VHT2SS_MCS3:    shift = 8;      break;
		case	MGN_VHT2SS_MCS4:    shift = 16;     break;
		case	MGN_VHT2SS_MCS5:    shift = 24;     break;
			
		case	MGN_VHT2SS_MCS6:	shift = 0; 		break;
		case	MGN_VHT2SS_MCS7:    shift = 8;      break;
		case	MGN_VHT2SS_MCS8:    shift = 16;     break;
		case	MGN_VHT2SS_MCS9:    shift = 24;     break;
			
		default:
			DBG_871X("Rate_Section is Illegal\n");
			break;
	}

	tx_pwr_diff = ( u8 ) (pHalData->TxPwrByRateOffset[Band][RfPath][TxNum][rate_section] >> shift) & 0xff;

	//DBG_871X("TxPwrByRateOffset-BAND(%d)-RF(%d)-RAS(%d)=%x tx_pwr_diff=%d shift=%d\n", 
	//Band, RfPath, TxNum, rate_section, pHalData->TxPwrByRateOffset[Band][RfPath][TxNum][rate_section], tx_pwr_diff, shift);

	return	tx_pwr_diff;
}

void
PHY_SetTxPowerByRateNew(
	IN	PADAPTER	pAdapter,
	IN	u32			Band,
	IN	u32			RfPath,
	IN	u32			TxNum,
	IN	u32			RegAddr,
	IN	u32			BitMask,
	IN	u32			Data
	)
{
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(pAdapter);
	u8			rate_section = PHY_GetRateSectionIndexOfTxPowerByRate( pAdapter, RegAddr, BitMask );

	if ( Band != BAND_ON_2_4G && Band != BAND_ON_5G )
	{
		DBG_871X("Invalid Band %d\n", Band );
	}

	if ( RfPath > ODM_RF_PATH_MAX )
	{
		DBG_871X("Invalid RfPath %d\n", RfPath );
	}

	if ( TxNum > ODM_RF_PATH_MAX )
	{
		DBG_871X("Invalid TxNum %d\n", TxNum );
	}
	
	pHalData->TxPwrByRateOffset[Band][RfPath][TxNum][rate_section] = Data;
	//DBG_871X("pHalData->TxPwrByRateOffset[Band %d][RfPath %d][TxNum %d][RateSection %d] = 0x%x\n", 
	//		Band, RfPath, TxNum, rate_section, pHalData->TxPwrByRateOffset[Band][RfPath][TxNum][rate_section]);
}

void 
PHY_SetTxPowerByRateOld(
	IN	PADAPTER		pAdapter,
	IN	u32				RegAddr,
	IN	u32				BitMask,
	IN	u32				Data
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	u8			index = PHY_GetRateSectionIndexOfTxPowerByRate( pAdapter, RegAddr, BitMask );

	pHalData->MCSTxPowerLevelOriginalOffset[pHalData->pwrGroupCnt][index] = Data;
	//DBG_871X("MCSTxPowerLevelOriginalOffset[%d][0] = 0x%x\n", pHalData->pwrGroupCnt,
	//	pHalData->MCSTxPowerLevelOriginalOffset[pHalData->pwrGroupCnt][0]);
}

VOID
PHY_InitTxPowerByRate(
	IN	PADAPTER	pAdapter
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	u1Byte band = 0, rfPath = 0, TxNum = 0, rateSection = 0, i = 0, j = 0;

	if ( IS_HARDWARE_TYPE_8188E( pAdapter ) || IS_HARDWARE_TYPE_8723A( pAdapter ) )
	{
		for ( i = 0; i < MAX_PG_GROUP; ++i )
			for ( j = 0; j < 16; ++j )
				pHalData->MCSTxPowerLevelOriginalOffset[i][j] = 0;
	}
	else
	{
		for ( band = BAND_ON_2_4G; band <= BAND_ON_5G; ++band )
				for ( rfPath = 0; rfPath < TX_PWR_BY_RATE_NUM_RF; ++rfPath )
					for ( TxNum = 0; TxNum < TX_PWR_BY_RATE_NUM_RF; ++TxNum )
						for ( rateSection = 0; rateSection < TX_PWR_BY_RATE_NUM_SECTION; ++rateSection )
							pHalData->TxPwrByRateOffset[band][rfPath][TxNum][rateSection] = 0;
	}
}

VOID
PHY_StoreTxPowerByRate(
	IN	PADAPTER	pAdapter,
	IN	u32			Band,
	IN	u32			RfPath,
	IN	u32			TxNum,
	IN	u32			RegAddr,
	IN	u32			BitMask,
	IN	u32			Data
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	PDM_ODM_T  		pDM_Odm = &pHalData->odmpriv;
	
	if ( pDM_Odm->PhyRegPgVersion > 0 )
	{
		PHY_SetTxPowerByRateNew( pAdapter, Band, RfPath, TxNum, RegAddr, BitMask, Data );
	}
	else if ( pDM_Odm->PhyRegPgVersion == 0 )
	{
		PHY_SetTxPowerByRateOld( pAdapter, RegAddr, BitMask, Data );
	
		if ( RegAddr == rTxAGC_A_Mcs15_Mcs12 && pHalData->rf_type == RF_1T1R )
			pHalData->pwrGroupCnt++;
		else if ( RegAddr == rTxAGC_B_Mcs15_Mcs12 && pHalData->rf_type != RF_1T1R )
			pHalData->pwrGroupCnt++;
	}
	else
		DBG_871X("Invalid PHY_REG_PG.txt version %d\n",  pDM_Odm->PhyRegPgVersion );
	
}


VOID
PHY_ConvertTxPowerByRateInDbmToRelativeValuesOld(
	IN	PADAPTER	pAdapter
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA( pAdapter );
	u8			base = 0;
	
	//DBG_871X("===>PHY_ConvertTxPowerByRateInDbmToRelativeValuesOld()\n" );
	
	// CCK
	base = PHY_GetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, RF_1TX, CCK );
	PHY_ConvertTxPowerByRateInDbmToRelativeValues( 
			&( pHalData->MCSTxPowerLevelOriginalOffset[0][6] ), 1, 1, base );
	PHY_ConvertTxPowerByRateInDbmToRelativeValues( 
			&( pHalData->MCSTxPowerLevelOriginalOffset[0][7] ), 1, 3, base );

	// OFDM
	base = PHY_GetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, RF_1TX, OFDM );
	PHY_ConvertTxPowerByRateInDbmToRelativeValues( 
			&( pHalData->MCSTxPowerLevelOriginalOffset[0][0] ), 0, 3, base );
	PHY_ConvertTxPowerByRateInDbmToRelativeValues( 
			&( pHalData->MCSTxPowerLevelOriginalOffset[0][1] ),	0, 3, base );

